In [82]:
import pandas as pd
from sklearn.cluster import MeanShift
import numpy as np
from scipy.spatial import distance

In [14]:
data = pd.read_csv('checkins.dat', sep='|', header=0, skipinitialspace=True)
data.dropna(inplace=True)
data.head()

/Users/ekaterinakryukova/opt/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3063: DtypeWarning: Columns (0) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,id,user_id,venue_id,latitude,longitude,created_at
2,984222,15824.0,5222.0,38.895112,-77.036366,2012-04-21 17:43:47
4,984234,44652.0,5222.0,33.800745,-84.410520,2012-04-21 17:43:43
8,984291,105054.0,5222.0,45.523452,-122.676207,2012-04-21 17:39:22
10,984318,2146539.0,5222.0,40.764462,-111.904565,2012-04-21 17:35:46
11,984232,93870.0,380645.0,33.448377,-112.074037,2012-04-21 17:38:18

In [30]:
data.columns

Index(['id    ', 'user_id ', 'venue_id ', 'latitude      ', 'longitude     ',
       'created_at      '],
      dtype='object')

In [ ]:
396634

In [25]:
data[:100000].shape[0]

100000

In [32]:
data['created_at      ']=pd.to_datetime(data['created_at      '])

In [46]:
data.iloc[:,3:5]

         latitude        longitude
2             38.895112      -77.036366
4             33.800745      -84.410520
8             45.523452     -122.676207
10            40.764462     -111.904565
11            33.448377     -112.074037
...                 ...             ...
1021960       40.850100      -73.866246
1021961       33.748995      -84.387982
1021962       42.765366      -71.467566
1021963       42.439479      -83.743830
1021965       42.331427      -83.045754

[396634 rows x 2 columns]

In [47]:
clustering = MeanShift(bandwidth=0.1).fit(data.iloc[:100000,3:5])

In [68]:
targets=clustering.cluster_centers_

In [70]:
targets.shape[0]

3231

In [77]:
type(targets)

numpy.ndarray

In [89]:
targets[0].shape

(2,)

In [80]:
shops=np.array([[33.751277, -118.188740],
[25.867736, -80.324116],
[51.503016, -0.075479],
[52.378894, 4.885084], 
[39.366487, 117.036146],
[-33.868457, 151.205134]])

In [93]:
shops[0][np.newaxis,:].shape

(1, 2)

In [84]:
shops

array([[ 3.37512770e+01, -1.18188740e+02],
       [ 2.58677360e+01, -8.03241160e+01],
       [ 5.15030160e+01, -7.54790000e-02],
       [ 5.23788940e+01,  4.88508400e+00],
       [ 3.93664870e+01,  1.17036146e+02],
       [-3.38684570e+01,  1.51205134e+02]])

In [95]:
distance.cdist(shops[0][np.newaxis,:], targets[0][np.newaxis,:], 'euclidean')

array([[44.74257092]])

In [161]:

df=[]
for shop in shops:
    for target in targets:
        d=distance.cdist(shop[np.newaxis,:], target[np.newaxis,:], 'euclidean')
        df.append([target[0],target[1],d.item(0)])

In [162]:
df=pd.DataFrame(df)

In [163]:
df

               0           1          2
0      40.717716  -73.991835  44.742571
1      33.449438 -112.002140   6.193959
2      33.446380 -111.901888   6.294241
3      41.878244  -87.629843  31.621097
4      37.688682 -122.409330   5.772048
...          ...         ...        ...
19381 -36.506376  148.301203   3.923192
19382 -37.713377  145.148916   7.173645
19383 -37.822983  145.181190   7.205982
19384 -41.292495  174.773235  24.709750
19385 -45.031162  168.662644  20.721260

[19386 rows x 3 columns]

In [170]:
df.sort_values(by=2,ascending=True)[:20]

               0           1         2
16575 -33.860630  151.204776  0.007835
10063  52.372964    4.892317  0.009353
3650   25.845672  -80.318891  0.022674
6520   51.502991   -0.125537  0.050058
51     33.809878 -118.148924  0.070848
3260   25.785812  -80.217938  0.134109
18371 -34.001906  151.128069  0.154103
3398   25.705350  -80.283429  0.167406
3323   26.010098  -80.199991  0.188876
18369 -33.952263  151.032137  0.192227
87     33.888325 -118.048928  0.195779
42     33.872986 -118.362091  0.211811
291    33.972575 -118.168371  0.222233
7264   51.426763   -0.303732  0.240653
10696  52.388501    4.633765  0.251502
8751   51.574152    0.183871  0.268929
3551   26.138844  -80.334347  0.271301
11966  52.264400    4.634700  0.275320
7468   51.506479   -0.365177  0.289719
119    33.983936 -118.007405  0.294979